In [1]:
import numpy as np
import pandas as pd

Es muy común que nuestros DataFrames presenten datos faltantes, antes de empezar a procesar nuestros DataFrames veamos un poco en qué consisten los objetos NaN (Not a Number).

Un número que no está definido usualmente se representa con el siguiente objeto:

In [3]:
show = np.nan
show

nan

¡Este objeto tiene propiedades matemáticas! Al sumar un número, obtenemos como
respuesta el mismo NaN.

In [14]:
np.nan + 0

nan

La versión 1.0 de pandas incluye un nuevo objeto NA, que es mucho más
general pues, además de interactuar con números, también puede hacerlo con
cadenas de texto u otras variables como las de tipo booleano. Si quieres que
esta nueva definición esté incluida entre tus cálculos usa:

In [10]:
 pd.options.mode.use_inf_as_na = False

In [13]:
np.nan > 0

False

Al sumar NA a una cadena de texto, obtengo el mismo NA:

In [12]:
pd.NA +'Hola mundo'

In [15]:
pd.NA | False

A continuación, vamos a crear un DataFrame

In [16]:
df = pd.DataFrame(np.arange(0, 15).reshape(5, 3), columns=['a', 'b', 'c'])
df

    a   b   c
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

Y vamos a añadir algunas variables no definidas:

In [17]:
df['d'] = np.nan
df['e'] = np.arange(15, 20)
df.loc[5,:] = pd.NA
df.loc[4,'a'] = pd.NA
df.loc[0,'d'] = 1
df.loc[5,'d'] = 10
df

      a     b     c    d     e
0   0.0   1.0   2.0    1  15.0
1   3.0   4.0   5.0  NaN  16.0
2   6.0   7.0   8.0  NaN  17.0
3   9.0  10.0  11.0  NaN  18.0
4  <NA>  13.0  14.0  NaN  19.0
5  <NA>  <NA>  <NA>   10  <NA>

Para reconocer cuándo un objeto es nulo, simplemente usamos:

In [18]:
df.isnull()

       a      b      c      d      e
0  False  False  False  False  False
1  False  False  False   True  False
2  False  False  False   True  False
3  False  False  False   True  False
4   True  False  False   True  False
5   True   True   True  False   True

En donde todas nuestras variables no definidas fueron marcadas con TRUE,

df.isna() también cumple esta función.

Conocer el número de variables nulas por columna puede hacerse juntando el comando anterior con la función de suma:

In [19]:
df.isnull().sum()

a    2
b    1
c    1
d    4
e    1
dtype: int64

Si lo que nos interesa es conocer el número de filas con elementos nulos, basta con usar axis=1:

In [42]:
df.isnull().sum(axis=1) #o columnas con axis=0

0    0
1    0
2    0
3    1
4    2
5    4
dtype: int64

O todos los elementos nulos de nuestro DataFrame:

In [26]:
df.isnull().sum().sum()

9

Reconocer estos elementos nos puede ayudar a filtrar en nuestro DataFrame, en
este caso, me gustaría filtrar por las variables no nulas de la columna ‘a’:

In [27]:
df[df['a'].notnull()]

     a     b     c    d     e
0  0.0   1.0   2.0    1  15.0
1  3.0   4.0   5.0  NaN  16.0
2  6.0   7.0   8.0  NaN  17.0
3  9.0  10.0  11.0  NaN  18.0

dropna es perfecto para eliminar rápidamente las filas con registros faltantes:

In [28]:
df.dropna()

     a    b    c  d     e
0  0.0  1.0  2.0  1  15.0

In [30]:
df[['a']].dropna()

     a
0  0.0
1  3.0
2  6.0
3  9.0

Ya que hemos visto cómo funcionan las variables nulas, veamos cómo lidiar con
ellas. Usando la función fillna podremos reemplazarlas por el valor que
queramos, en este caso 0.

In [31]:
df.fillna(0)

     a     b     c   d     e
0  0.0   1.0   2.0   1  15.0
1  3.0   4.0   5.0   0  16.0
2  6.0   7.0   8.0   0  17.0
3  9.0  10.0  11.0   0  18.0
4  0.0  13.0  14.0   0  19.0
5  0.0   0.0   0.0  10   0.0

Si quisiéramos remplazar con el valor siguiente usamos
method='ffill':

In [32]:
df.fillna(method='ffill')

     a     b     c   d     e
0  0.0   1.0   2.0   1  15.0
1  3.0   4.0   5.0   1  16.0
2  6.0   7.0   8.0   1  17.0
3  9.0  10.0  11.0   1  18.0
4  9.0  13.0  14.0   1  19.0
5  9.0  13.0  14.0  10  19.0

Si quisiéramos remplazar con el valor previo usamos
method='bfill':

In [33]:
df.fillna(method='bfill')

      a     b     c   d     e
0   0.0   1.0   2.0   1  15.0
1   3.0   4.0   5.0  10  16.0
2   6.0   7.0   8.0  10  17.0
3   9.0  10.0  11.0  10  18.0
4  <NA>  13.0  14.0  10  19.0
5  <NA>  <NA>  <NA>  10  <NA>

El mismo ejercicio anterior se puede aplicar con las filas usando axis=1:

In [34]:
df.fillna(method='bfill',axis=1)

      a     b     c     d     e
0   0.0   1.0   2.0   1.0  15.0
1   3.0   4.0   5.0  16.0  16.0
2   6.0   7.0   8.0  17.0  17.0
3   9.0  10.0  11.0  18.0  18.0
4  13.0  13.0  14.0  19.0  19.0
5  10.0  10.0  10.0  10.0  <NA>

Podemos usar también una serie para reemplazar los valores de una columna en específico, es importante que haya emparejamiento entre los índices:

In [35]:
fill = pd.Series([100, 101, 102])
fill

0    100
1    101
2    102
dtype: int64

In [37]:
df['d'] = df['d'].fillna(fill)
df['d']

0      1.0
1    101.0
2    102.0
3      NaN
4      NaN
5     10.0
Name: d, dtype: float64

In [38]:
df

      a     b     c      d     e
0   0.0   1.0   2.0    1.0  15.0
1   3.0   4.0   5.0  101.0  16.0
2   6.0   7.0   8.0  102.0  17.0
3   9.0  10.0  11.0    NaN  18.0
4  <NA>  13.0  14.0    NaN  19.0
5  <NA>  <NA>  <NA>   10.0  <NA>

Una de las formas más usadas para reemplazar datos es usar el promedio de las columnas, esto se hace con la función mean. O si se quiere un mejor estimador, usamos median.

In [39]:
df.fillna(df.median())

     a     b     c      d     e
0  0.0   1.0   2.0    1.0  15.0
1  3.0   4.0   5.0  101.0  16.0
2  6.0   7.0   8.0  102.0  17.0
3  9.0  10.0  11.0   55.5  18.0
4  4.5  13.0  14.0   55.5  19.0
5  4.5   7.0   8.0   10.0  17.0

Por último, Pandas también puede interpolar los valores faltantes calculando el valor que puede haber existido en el medio.

In [40]:
df_d = pd.concat([df[['d']], df[['d']].interpolate()],axis=1)
df_d.columns = ['d_antes','d_interpolado']
df_d

   d_antes  d_interpolado
0      1.0       1.000000
1    101.0     101.000000
2    102.0     102.000000
3      NaN      71.333333
4      NaN      40.666667
5     10.0      10.000000